# Materials Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GroupTypeId..::..Materials Property
GroupTypeId Class See Also
---
"Materials and Finishes"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Materials { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Materials As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Materials {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace